html-game.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CodeLab I</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Matt Thompson">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">CodeLab I</h1>
</header><br>

<div id="outline-container-org296c11c" class="outline-2">
<h2 id="org296c11c">Week 18 workshop: HTML Mystery Game</h2>
<div class="outline-text-2" id="text-org296c11c">
<p>
This week's task is to design and create an HTML "mystery" game, where you have to solve puzzles to get to the next page.
</p>

<p>
A good example of this kind of game is "Cipher": <a href="http://gamemastertips.com/cipher/cipher.htm">http://gamemastertips.com/cipher/cipher.htm</a>. Have a play through it and see how far you can get!
</p>

<p>
Some hints:
</p>

<ul class="org-ul">
<li>Level 1 is easy. But things get a little bit trickier once you get to level 2!</li>
<li>Look at the title in the tab for a clue as to what you should do.</li>
<li>The idea is to "cheat" to get to the next level. What's the quickest way to get to level 3? Is there something you can do to the URL in the address bar to get there?</li>
</ul>

<p>
This game is actually pretty tricky, but can be addictive once you get the hang of it! Let me know how far you get next week.
</p>

<p>
Once you've got the idea, I want you to create your own version of this game. You can create images and sounds with clues embedded in them. Or you can embed clues from other websites. Here's some ideas to get you going:
</p>

<ul class="org-ul">
<li>one clue could be an embedded Spotify playlist where the first letters of each song title spell a word that you have to type into the URL bar</li>
<li>embed a Google map with a route planned that ends with a note with a link to the next page</li>
<li>embed a sound of yourself saying the name of the next URL to type. But backwards! The player of the game will have to download the sound and reverse it using audio software such as Audacity.</li>
<li>embed several Youtube videos into the site, which start at different times. When you play them, a character from a movie says a word. You have to work out how to form a sentence from these words, and type it into a text box, which will take you to the next page (you can use HTML form validation to do this).</li>
<li>(this is an advanced one!) read the Wikipedia article on <a href="https://en.wikipedia.org/wiki/Steganography">steganography</a>, and see if you can embed a hidden message inside an image!</li>
</ul>

<p>
Have fun with it! I would love to see what you come up with in next week's workshop.
</p>
</div>
</div>
</div>
</body>
</html>